_posts/2016-07-02-pattern-matching.html
---
layout: post
title: Pattern matching
excerpt: A great language feature for writing clean code
---

<p>
I've long had a vague idea of what <b>pattern matching</b> is, but never really appreciated why it is a desirable feature in programming languages. We recently covered the topic of pattern matching in the <a href="https://www.coursera.org/learn/progfun1/lecture/cdHAM/lecture-4-6-pattern-matching">Functional Programming Principles in Scala</a> course I'm taking, and I feel that I now have a much better understanding of it.
</p>

<p>
The C2 wiki's <a href="http://c2.com/cgi/wiki?PatternMatching">page on pattern matching</a> contains a much better description than <a href="https://en.wikipedia.org/wiki/Pattern_matching">Wikipedia's</a>, which is to be expected for such technical topics. In short,
</p>

<blockquote>
<p>
Pattern matching is the compiler's ability to compare both the form and the content of two expressions.
</p>
</blockquote>

<p>
It is a <b>dispatch mechanism</b> for choosing which variant of a function to call based on the form and content of its argument(s).
</p>

<p>
The value of pattern matching is in making programming more <i>declarative</i> and <i>logical</i>. Declarative programming lets the programmer to focus on the <i>what</i> instead of the <i>how</i>. This allows programming at a higher level and focusing more on the problem domain, which should increase the odds that the program is correct.
</p>

<p>
Coming from Clojure, I can best understand pattern matching as a combination of two familiar concepts:
</p>

<ul class="org-ul">
<li><a href="https://clojuredocs.org/clojure.core/case">case</a> expressions
</li>
<li><a href="http://clojure.org/guides/destructuring">Destructuring</a>
</li>
</ul>

<p>
In languages without pattern matching, it is necessary to explicitly check the form and content of inputs, which leads to a lot of boilerplate.
</p>

<p>
Consider the following implementation of <code>flatten</code> in Scheme:
</p>

<div class="org-src-container">

<pre class="src src-scheme">(define (flatten x)
  (cond ((null? x) '())
        ((pair? x) (append (flatten (car x)) (flatten (cdr x))))
        (else (list x))))
</pre>
</div>

<p>
Here, we have to explicitly use a <code>cond</code> on <code>x</code> to decide what to do.
</p>

<p>
In Scala, the <a href="http://stackoverflow.com/a/24128335/864684">solution</a> is more declarative, and therefore easier to read and understand:
</p>

<div class="org-src-container">

<pre class="src src-scala">def flatten(xs: List[Any]): List[Any] = xs match {
  case List() =&gt; List()
  case (y :: ys) :: yss =&gt; flatten(y :: ys) ::: flatten(yss)
  case y :: ys =&gt; y :: flatten(ys)
}
</pre>
</div>

<p>
In fact, Philip Wadler wrote a <a href="https://www.cs.kent.ac.uk/people/staff/dat/miranda/wadler87.pdf">whole critique of SICP</a>, and lack of pattern matching is the first issue he raises (along with non-mathematical synatx, lack of static and user-defined types, and lack of lazy evaluation). For more, see a <a href="http://www.leonardoborges.com/writings/2013/03/25/clojure-and-why-calculating-is-better-than-scheming/">critique of the critique</a> by Leonardo Borges using Clojure and Haskell.
</p>

<p>
Clojure supports pattern matching through a library, <a href="https://github.com/clojure/core.match">core.match</a>. As a dispatching mechanism, however, pattern matching <a href="http://programmers.stackexchange.com/a/237026/194163">seems to be less idiomatic</a> than <a href="http://clojure.org/reference/multimethods">multimethods</a>. Multimethods allow dispatching on arguments based on an arbitrary <b>dispatching function</b>, which is even more general than pattern matching; however, it is less concise and, in my opinion, less elegant.
</p>
